// pages/statement/statement.ts
Page({

  /**
   * 页面的初始数据
   */
  data: {
      nodes:`
      <h1>户外经验分享应用声明及协议</h1>

<p>欢迎使用户外经验分享应用！</p>

<p>本声明中，“户外经验分享应用”指我们提供的所有服务和功能。我们致力于为用户提供一个分享户外经验和心得、学习并获取户外知识的线上平台。</p>

<p>在开始使用户外经验分享应用之前，请详细阅读以下声明。</p>

<h2>内容共享</h2>

<ol>
  <li>用户在使用本应用时，其发布的所有信息应当真实、准确，不得发布任何虚假、误导、恶意、煽动性的信息。</li>
  <li>户外活动可能存在安全风险，因此在分享经验时，用户有义务确保信息的准确性并在适当的情况下提供安全警告。</li>
  <li>用户不得在此应用上发布任何涉及政治、性别、种族或者宗教等可能引发争议的内容。</li>
  <li>我们保留在任何时候删除或编辑用户发布内容的权利，如果该内容违反了上述规定。</li>
</ol>

<h2>隐私政策</h2>

<p>我们尊重并重视每个用户的隐私。我们收集您的信息仅用于提供服务并改善用户体验。对于您提供给我们的所有个人身份信息，我们承认并尊重您的所有权利并会采取合理的保护措施。</p>

<h2>法律责任</h2>

<p>户外经验分享应用充分尊重并保护用户的合法权益，用户应当明白，所有发布于此应用的内容、评论等，其版权均属原作者所有，若有侵犯版权等问题，请及时与我们联系。</p>

<p>对于用户在使用本应用过程中涉及的侵权行为，用户应自行负责。同时，如果用户的行为给户外经验分享应用或第三方造成任何损害，用户同意承担所有相应的法律责任。</p>

<h2>服务变更、中断或终止</h2>

<p>如果需要，我们可以单方面更改或中断服务，而无需通知用户。如果用户不再需要我们的服务，也可以主动停止使用。如果发生争议，应根据中华人民共和国法律法规进行处理。</p>

<p>在您使用户外经验分享应用的过程中，如果有任何问题或需要协助，请联系我们。</p>

<p>感谢您选择户外经验分享应用，希望您在这里的每一刻都充满收获与喜悦。</p>

<p><b>请注意，以上声明仅供参考，具体条款可根据实际情况进行调整。建议您与专业律师进行咨询，以确保您的条款符合所有法规要求。</b></p>
      `
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad() {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})